;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; DO NOT EDIT THIS FILE DIRECTLY
;; This is a file generated from a literate programing source file located at
;; https://gitlab.com/zzamboni/dot-doom/-/blob/master/doom.org
;; You should make any changes there and regenerate it from Emacs org-mode
;; using org-babel-tangle (C-c C-v t)

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.

;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;;(package! another-package
;;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;;(package! this-package
;;  :recipe (:host github :repo "username/repo"
;;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;;(package! builtin-package :recipe (:nonrecursive t))
;;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;;(package! builtin-package :pin "1a2b3c4d5e")

;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;;(unpin! pinned-package)
;; ...or multiple packages
;;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;;(unpin! t)

;;; doom-disabled-packages

(package! demangle-mode :disable t)
(package! cuda-mode :disable t)
(package! opencl-mode :disable t)

(package! diredfl :disable t) ; conflict @denote
(package! dirvish :disable t)
(package! code-review :disable t) ; not working

;; checkers
(package! flyspell-lazy :disable t)
(package! flymake-popon :disable t)
(package! flycheck-popup-tip :disable t) ; conflict
(package! flycheck-plantuml :disable t)
(package! flycheck :disable t)
(package! lsp-mode :disable t) ; use eglot

(package! nose :disable t) ; python module
(package! lsp-python-ms :disable t)

(package! vundo :disable t)
(package! undo-fu-session :disable t)
(package! elfeed-goodies :disable t)
(package! solaire-mode :disable t)
;; (package! ace-window :disable t)

(package! treemacs-nerd-icons :disable t)

;; (package! corfu-popupinfo :disable t)

(package! evil-snipe :disable t)
(package! evil-goggles :disable t)
;; (package! evil-mc :disable t)

(package! evil-terminal-cursor-changer :disable t) ; conflict on kitty
;; (package! kkp :disable t) ; conflict on term-keys

;;; module-emacs-config.el

(package! dired-preview)

;;; additional packages

(package! denote)
(package! denote-org)

(package! denote-silo)
(package! denote-sequence)
(package! denote-markdown)

(package! denote-search)
(package! denote-regexp)

(package! citar-denote)

(package! consult-notes)
(package! consult-denote)

(package! denote-explore :recipe (:host github :repo "pprevos/denote-explore"))

;;;; ui-config.el

(unpin! doom-themes)
(package! doom-themes :recipe (:host github :repo "junghan0611/doom-themes" :branch "ko"))
(package! modus-themes)
(package! doric-themes)
(package! ef-themes)
(package! spacious-padding)
(package! winpulse :recipe (:host github :repo "xenodium/winpulse"))

;;;; Editing

(package! tempel)
(package! tempel-collection)
(package! imenu-list :recipe (:host github :repo "junghan0611/imenu-list" :branch "master"))
(package! clipetty) ; osc52 support
(package! adoc-mode :recipe (:host github :repo "junghan0611/adoc-mode")) ; AsciiDoc editing (테이블 병합 셀 지원)

;;;; prog-mode-config.el

(package! aggressive-indent)
;; (package! org-linenote) ; require lsp-mode

;;;; org-config.el

(package! org-download)
(package! org-rich-yank)
(package! org-appear)

;;;; editing-config.el

(package! outli :recipe (:host github :repo "jdtsmith/outli" :files ("*.el")))
(package! ten :recipe (:host sourcehut :repo "nobiot/ten")) ;; https://git.sr.ht/~nobiot/ten
(package! pinentry)

;;;; project-config.el

(package! git-link)
(package! magit-todos)
(package! magit-gh)
;; (package! majutsu :recipe (:host github :repo "0WD0/majutsu"))
(package! tmr) ;; TODO Time Management

;;;; Transient Menu

;; (package! casual)
(package! password-store-menu)

;;;; tmux/zellij orchestration

(package! emamux)  ; tmux manipulation from Emacs

;;;; ai-gptel.el

(unpin! gptel)
(package! macher)
(package! uuidgen) ; for gptel-prompt
(package! gptel-prompt :recipe (:host github :repo "jwiegley/gptel-prompts"))
(package! yaml)      ; for .poet templates
(package! templatel) ; for .poet templates (Jinja2-like)
(package! gptel-litellm :recipe (:host github :repo "jwiegley/gptel-litellm"))

;; (package! minuet :recipe (:host github :repo "ElleNajt/minuet-ai.el"))

;;;; ai-orchestration.el

;; Efrit: Local development (조건부 로딩)
;; 경로 변경은 아래 한 줄만 수정!
;; (when (file-directory-p "~/.emacs.d/site-lisp/efrit/")
;;   (package! efrit :recipe (:local-repo "~/.emacs.d/site-lisp/efrit/" :files ("lisp/*.el"))))
(package! beads :recipe (:host github :repo "ChristianTietze/beads.el"))

;;;; ai-agent-shell.el

(package! shell-maker)
(package! acp :recipe (:host github :repo "xenodium/acp.el"))
(package! agent-shell :recipe (:host github :repo "xenodium/agent-shell"))
(package! agent-shell-manager :recipe (:host github :repo "ElleNajt/agent-shell-manager"))
(package! agent-shell-sidebar :recipe (:host github :repo "cmacrae/agent-shell-sidebar"))
(package! agent-shell-attention.el :recipe (:host github :repo "ultronozm/agent-shell-attention.el"))
(package! meta-agent-shell :recipe (:host github :repo "ElleNajt/meta-agent-shell"))

(package! phscroll) ; for pi-coding-agent
(package! pi-coding-agent :recipe (:host github :repo "junghan0611/pi-coding-agent"))

;;;;; DONT vterm based solutions

;; (package! claude-code :recipe (:host github :repo "stevemolitor/claude-code.el" ))
;; (unless IS-TERMUX
;;   (package! monet :recipe (:host github :repo "stevemolitor/monet" )))
;; (package! claude-code-ide :recipe (:host github :repo "manzaltu/claude-code-ide.el" ))

;;;; ai-bot-config.el

(package! telega)

;;;; ai-stt-eca-whisper.el

(package! whisper :recipe (:host github :repo "natrys/whisper.el"))
(package! eca :recipe (:host github :repo "editor-code-assistant/eca-emacs" :files ("*.el")))
(package! semext :recipe (:host github :repo "ahyatt/semext"))

;;;; elfeed-config.el

(package! simple-httpd)  ; elfeed-web 의존성
(package! org-web-tools)

;;;; tab-bar-config.el

(package! celestial-mode-line)
;; (package! keycast)

;;;; search-config.el

(package! recent-rgrep :recipe (:host github :repo "kickingvegas/recent-rgrep"))
(package! consult-ripfd :recipe (:host github :repo "jdtsmith/consult-ripfd"))

;;;; completion-config.el

;;; DEPRECATED

(package! org-glossary :recipe (:host github :repo "tecosaur/org-glossary" :files ("*.el" "*.org" "*.texi")))
(package! casual)

;;; END
